---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.BalusterPattern
source: html/a6860afc-ac8e-f5eb-7d0a-7ab89ded67f3.htm
---
# BalusterPattern Properties

The condition which controls breaking baluster patterns distribution.